avr-rust/avrd/packs/tiny/ATtiny20.atdf
<?xml version="1.0" encoding="UTF-8"?>
<avr-tools-device-file xmlns:xalan="http://xml.apache.org/xalan" xmlns:NumHelper="NumHelper" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" schema-version="0.3" xsi:noNamespaceSchemaLocation="../../schema/avr_tools_device_file.xsd">
  <variants>
    <variant ordercode="ATtiny20-UUR" speedmax="12000000" tempmin="-40" tempmax="85" vccmin="1.8" vccmax="5.5" package="WLCSP12" pinout="WLCSP"/>
    <variant ordercode="ATtiny20-SSU" speedmax="12000000" tempmin="-40" tempmax="85" vccmin="1.8" vccmax="5.5" package="SOIC14"  pinout="DIP"/>
    <variant ordercode="ATtiny20-XU"  speedmax="12000000" tempmin="-40" tempmax="85" vccmin="1.8" vccmax="5.5" package="TSSOP14" pinout="DIP"/>
    <variant ordercode="ATtiny20-CCU" speedmax="12000000" tempmin="-40" tempmax="85" vccmin="1.8" vccmax="5.5" package="UFBGA15" pinout="UFBGA"/>
    <variant ordercode="ATtiny20-MMH" speedmax="12000000" tempmin="-40" tempmax="85" vccmin="1.8" vccmax="5.5" package="VQFN20"  pinout="VQFN"/>
  </variants>
  <devices>
    <device name="ATtiny20" architecture="AVR8L" family="tinyAVR">
      <address-spaces>
        <address-space endianness="little" name="prog" id="prog" start="0x0000" size="0x0800">
          <memory-segment start="0x0000" size="0x0800" type="flash" rw="RW" exec="1" name="FLASH" pagesize="0x80"/>
        </address-space>
        <address-space endianness="little" name="signatures" id="signatures" start="0" size="3">
          <memory-segment start="0" size="3" type="signatures" rw="R" exec="0" name="SIGNATURES"/>
        </address-space>
        <address-space endianness="little" name="fuses" id="fuses" start="0" size="0x0001">
          <memory-segment start="0" size="0x0001" type="fuses" rw="RW" exec="0" name="FUSES"/>
        </address-space>
        <address-space endianness="little" name="lockbits" id="lockbits" start="0" size="0x0001">
          <memory-segment start="0" size="0x0001" type="lockbits" rw="RW" exec="0" name="LOCKBITS"/>
        </address-space>
        <address-space size="0x4800" start="0x0000" endianness="little" name="data" id="data">
          <memory-segment type="io" size="0x40" start="0x0000" name="IO"/>
          <memory-segment type="ram" size="0x80" start="0x0040" name="SRAM"/>
          <memory-segment type="sysreg" size="0x0002" start="0x3F00" name="MAPPED_NVM_LOCK_BITS"/>
          <memory-segment type="sysreg" size="0x0002" start="0x3F40" name="MAPPED_CONFIGURATION_BITS"/>
          <memory-segment type="sysreg" size="0x0002" start="0x3F80" name="MAPPED_CALIBRATION_BITS"/>
          <memory-segment type="sysreg" size="0x0004" start="0x3FC0" name="MAPPED_DEVICE_ID_BITS"/>
          <memory-segment type="flash" start="0x4000" name="MAPPED_FLASH" size="0x0800"/>
        </address-space>
        <address-space endianness="little" name="osccal" id="osccal" start="0" size="1">
          <memory-segment start="0" size="1" type="osccal" rw="R" exec="0" name="OSCCAL"/>
        </address-space>
      </address-spaces>
      <peripherals>
        <module name="PORT">
          <instance name="PORTB" caption="I/O Port">
            <register-group name="PORTB" name-in-module="PORTB" offset="0x00" address-space="data" caption="I/O Port"/>
            <signals>
              <signal group="P" index="0" pad="PB0" function="default"/>
              <signal group="P" index="1" pad="PB1" function="default"/>
              <signal group="P" index="2" pad="PB2" function="default"/>
              <signal group="P" index="3" pad="PB3" function="default"/>
            </signals>
          </instance>
          <instance name="PORTA" caption="I/O Port">
            <register-group name="PORTA" name-in-module="PORTA" offset="0x00" address-space="data" caption="I/O Port"/>
            <signals>
              <signal group="P" index="0" pad="PA0" function="default"/>
              <signal group="P" index="1" pad="PA1" function="default"/>
              <signal group="P" index="2" pad="PA2" function="default"/>
              <signal group="P" index="3" pad="PA3" function="default"/>
              <signal group="P" index="4" pad="PA4" function="default"/>
              <signal group="P" index="5" pad="PA5" function="default"/>
              <signal group="P" index="6" pad="PA6" function="default"/>
              <signal group="P" index="7" pad="PA7" function="default"/>
            </signals>
          </instance>
        </module>
        <module name="WDT">
          <instance name="WDT" caption="Watchdog Timer">
            <register-group name="WDT" name-in-module="WDT" offset="0x00" address-space="data" caption="Watchdog Timer"/>
          </instance>
        </module>
        <module name="ADC">
          <instance name="ADC" caption="Analog-to-Digital Converter">
            <register-group name="ADC" name-in-module="ADC" offset="0x00" address-space="data" caption="Analog-to-Digital Converter"/>
            <signals>
              <signal group="ADC" index="0" pad="PA0" function="default"/>
              <signal group="ADC" index="1" pad="PA1" function="default"/>
              <signal group="ADC" index="2" pad="PA2" function="default"/>
              <signal group="ADC" index="3" pad="PA3" function="default"/>
              <signal group="ADC" index="4" pad="PA4" function="default"/>
              <signal group="ADC" index="5" pad="PA5" function="default"/>
              <signal group="ADC" index="6" pad="PA6" function="default"/>
              <signal group="ADC" index="7" pad="PA7" function="default"/>
            </signals>
          </instance>
        </module>
        <module name="AC">
          <instance name="AC" caption="Analog Comparator">
            <register-group name="AC" name-in-module="AC" offset="0x00" address-space="data" caption="Analog Comparator"/>
            <signals>
              <signal group="AIN" index="0" pad="PA1" function="default"/>
              <signal group="AIN" index="1" pad="PA2" function="default"/>
            </signals>
          </instance>
        </module>
