avr-rust/avrd/packs/tiny/ATtiny20.atdf
        <module name="CPU">
          <instance name="CPU" caption="CPU Registers">
            <register-group name="CPU" name-in-module="CPU" offset="0x00" address-space="data" caption="CPU Registers"/>
          </instance>
        </module>
        <module name="EXINT">
          <instance name="EXINT" caption="External Interrupts">
            <register-group name="EXINT" name-in-module="EXINT" offset="0x00" address-space="data" caption="External Interrupts"/>
            <signals>
              <signal group="PCINT" index="0" pad="PA0" function="default"/>
              <signal group="PCINT" index="1" pad="PA1" function="default"/>
              <signal group="PCINT" index="2" pad="PA2" function="default"/>
              <signal group="PCINT" index="3" pad="PA3" function="default"/>
              <signal group="PCINT" index="4" pad="PA4" function="default"/>
              <signal group="PCINT" index="5" pad="PA5" function="default"/>
              <signal group="PCINT" index="6" pad="PA6" function="default"/>
              <signal group="PCINT" index="7" pad="PA7" function="default"/>
              <signal group="PCINT" index="8" pad="PB0" function="default"/>
              <signal group="PCINT" index="9" pad="PB1" function="default"/>
              <signal group="PCINT" index="10" pad="PB2" function="default"/>
              <signal group="PCINT" index="11" pad="PB3" function="default"/>
              <signal group="INT" index="0" pad="PB2" function="default"/>
            </signals>
          </instance>
        </module>
        <module name="TC8">
          <instance name="TC0" caption="Timer/Counter, 8-bit">
            <register-group name="TC0" name-in-module="TC0" offset="0x00" address-space="data" caption="Timer/Counter, 8-bit"/>
            <signals>
              <signal group="OCB" pad="PA7" function="default"/>
              <signal group="OCA" pad="PB2" function="default"/>
              <signal group="T" pad="PB0" function="default"/>
            </signals>
          </instance>
        </module>
        <module name="TWI">
          <instance name="TWI" caption="Two Wire Serial Interface">
            <register-group name="TWI" name-in-module="TWI" offset="0x00" address-space="data" caption="Two Wire Serial Interface"/>
            <signals>
              <signal group="SCL" pad="PA7" function="default"/>
              <signal group="SDA" pad="PB1" function="default"/>
            </signals>
          </instance>
        </module>
        <module name="TC16">
          <instance name="TC1" caption="Timer/Counter, 16-bit">
            <register-group name="TC1" name-in-module="TC1" offset="0x00" address-space="data" caption="Timer/Counter, 16-bit"/>
            <signals>
              <signal group="OCA" pad="PB1" function="default"/>
              <signal group="OCB" pad="PB2" function="default"/>
              <signal group="ICP" pad="PA7" function="default"/>
              <signal group="T" pad="PA7" function="default"/>
            </signals>
          </instance>
        </module>
        <module name="SPI">
          <instance name="SPI" caption="Serial Peripheral Interface">
            <register-group name="SPI" name-in-module="SPI" offset="0x00" address-space="data" caption="Serial Peripheral Interface"/>
            <signals>
              <signal group="SS" pad="PA6" function="default"/>
              <signal group="MOSI" pad="PB1" function="default"/>
              <signal group="MISO" pad="PB2" function="default"/>
              <signal group="SCK" pad="PA7" function="default"/>
            </signals>
          </instance>
        </module>
        <module name="FUSE">
          <instance name="FUSE" caption="Fuses">
            <register-group name="FUSE" name-in-module="FUSE" offset="0" address-space="fuses" caption="Fuses"/>
          </instance>
        </module>
        <module name="LOCKBIT">
          <instance name="LOCKBIT" caption="Lockbits">
            <register-group name="LOCKBIT" name-in-module="LOCKBIT" offset="0" address-space="lockbits" caption="Lockbits"/>
          </instance>
        </module>
      </peripherals>
      <interrupts>
        <interrupt index="0" name="RESET" caption="External Reset, Power-on Reset and Watchdog Reset"/>
        <interrupt index="1" name="INT0" caption="External Interrupt Request 0"/>
        <interrupt index="2" name="PCINT0" caption="Pin Change Interrupt Request 0"/>
        <interrupt index="3" name="PCINT1" caption="Pin Change Interrupt Request 1"/>
        <interrupt index="4" name="WDT" caption="Watchdog Time-out"/>
        <interrupt index="5" name="TIM1_CAPT" caption="Timer/Counter1 Input Capture"/>
        <interrupt index="6" name="TIM1_COMPA" caption=" Timer/Counter1 Compare Match A"/>
        <interrupt index="7" name="TIM1_COMPB" caption=" Timer/Counter1 Compare Match B"/>
        <interrupt index="8" name="TIM1_OVF" caption="Timer/Counter1 Overflow"/>
        <interrupt index="9" name="TIM0_COMPA" caption="Timer/Counter0 Compare Match A"/>
        <interrupt index="10" name="TIM0_COMPB" caption="Timer/Counter0 Compare Match B"/>
        <interrupt index="11" name="TIM0_OVF" caption="Timer/Counter0 Overflow"/>
        <interrupt index="12" name="ANA_COMP" caption="Analog Comparator"/>
        <interrupt index="13" name="ADC_ADC" caption="Conversion Complete"/>
        <interrupt index="14" name="TWI_SLAVE" caption="Two-Wire Interface"/>
        <interrupt index="15" name="SPI" caption="Serial Peripheral Interface"/>
        <interrupt index="16" name="QTRIP" caption="Touch Sensing"/>
      </interrupts>
      <interfaces>
        <interface name="TPI" type="tpi"/>
      </interfaces>
      <property-groups>
        <property-group name="SIGNATURES">
          <property name="SIGNATURE0" value="0x1e"/>
          <property name="SIGNATURE1" value="0x91"/>
          <property name="SIGNATURE2" value="0x0f"/>
        </property-group>
      </property-groups>
    </device>
  </devices>
  <modules>
    <module caption="Fuses" name="FUSE">
      <register-group caption="Fuses" name="FUSE">
        <register caption="" name="BYTE0" offset="0x00" size="1" initval="0xFF">
          <bitfield caption="Brown-out Detector trigger level" mask="0x70" name="BODLEVEL" values="ENUM_BODLEVEL"/>
          <bitfield caption="Output external clock" mask="0x04" name="CKOUT"/>
          <bitfield caption="Watch dog timer always on" mask="0x02" name="WDTON"/>
          <bitfield caption="Disable external reset" mask="0x01" name="RSTDISBL"/>
        </register>
      </register-group>
      <value-group caption="" name="ENUM_BODLEVEL">
        <value caption="Brown-out detection disabled; [BODLEVEL=111]" name="DISABLED" value="0x07"/>
        <value caption="Brown-out detection at VCC=1.8 V" name="1V8" value="0x06"/>
        <value caption="Brown-out detection at VCC=2.7 V" name="2V7" value="0x05"/>
        <value caption="Brown-out detection at VCC=4.3 V" name="4V3" value="0x04"/>
      </value-group>
    </module>
