avr-rust/avrd/packs/tiny/ATtiny20.atdf
    <module caption="Lockbits" name="LOCKBIT">
      <register-group caption="Lockbits" name="LOCKBIT">
        <register caption="" name="LOCKBIT" offset="0x00" size="1">
          <bitfield caption="Memory Lock" mask="0x03" name="LB" values="ENUM_LB"/>
        </register>
      </register-group>
      <value-group caption="" name="ENUM_LB">
        <value caption="Further programming and verification disabled" name="PROG_VER_DISABLED" value="0x00"/>
        <value caption="Further programming disabled" name="PROG_DISABLED" value="0x02"/>
        <value caption="No memory lock features enabled" name="NO_LOCK" value="0x03"/>
      </value-group>
    </module>
    <module caption="I/O Port" name="PORT">
      <register-group caption="I/O Port" name="PORTB">
        <register caption="Port Control Register" name="PORTCR" offset="0x08" size="1">
          <bitfield caption="Break-Before-Make Mode Enable" mask="0x02" name="BBMB"/>
        </register>
        <register caption="Pull-up Enable Control Register" name="PUEB" offset="0x07" size="1" mask="0x0F"/>
        <register caption="Data Direction Register, Port B" name="DDRB" offset="0x05" size="1" mask="0x0F"/>
        <register caption="Port B Data register" name="PINB" offset="0x04" size="1" mask="0x0F"/>
        <register caption="Input Pins, Port B" name="PORTB" offset="0x06" size="1" mask="0x0F"/>
      </register-group>
      <register-group caption="I/O Port" name="PORTA">
        <register caption="Port Control Register" name="PORTCR" offset="0x08" size="1">
          <bitfield caption="Break-Before-Make Mode Enable" mask="0x01" name="BBMA"/>
        </register>
        <register caption="Pull-up Enable Control Register" name="PUEA" offset="0x03" size="1" mask="0xFF"/>
        <register caption="Port A Data Register" name="PORTA" offset="0x02" size="1" mask="0xFF"/>
        <register caption="Data Direction Register, Port A" name="DDRA" offset="0x01" size="1" mask="0xFF"/>
        <register caption="Port A Input Pins" name="PINA" offset="0x00" size="1" mask="0xFF"/>
      </register-group>
    </module>
    <module caption="Watchdog Timer" name="WDT">
      <register-group caption="Watchdog Timer" name="WDT">
        <register caption="Watchdog Timer Control and Status Register" name="WDTCSR" offset="0x31" size="1">
          <bitfield caption="Watchdog Timer Interrupt Flag" mask="0x80" name="WDIF"/>
          <bitfield caption="Watchdog Timer Interrupt Enable" mask="0x40" name="WDIE"/>
          <bitfield caption="Watchdog Timer Prescaler Bits" mask="0x27" name="WDP" values="WDOG_TIMER_PRESCALE_4BITS"/>
          <bitfield caption="Watch Dog Enable" mask="0x08" name="WDE"/>
        </register>
      </register-group>
      <value-group caption="" name="WDOG_TIMER_PRESCALE_4BITS">
        <value caption="Oscillator Cycles 2K" name="VAL_0x00" value="0x00"/>
        <value caption="Oscillator Cycles 4K" name="VAL_0x01" value="0x01"/>
        <value caption="Oscillator Cycles 8K" name="VAL_0x02" value="0x02"/>
        <value caption="Oscillator Cycles 16K" name="VAL_0x03" value="0x03"/>
        <value caption="Oscillator Cycles 32K" name="VAL_0x04" value="0x04"/>
        <value caption="Oscillator Cycles 64K" name="VAL_0x05" value="0x05"/>
        <value caption="Oscillator Cycles 128K" name="VAL_0x06" value="0x06"/>
        <value caption="Oscillator Cycles 256K" name="VAL_0x07" value="0x07"/>
        <value caption="Oscillator Cycles 512K" name="VAL_0x08" value="0x08"/>
        <value caption="Oscillator Cycles 1024K" name="VAL_0x09" value="0x09"/>
      </value-group>
    </module>
    <module caption="Analog-to-Digital Converter" name="ADC">
      <register-group caption="Analog-to-Digital Converter" name="ADC">
        <register caption="The ADC multiplexer Selection Register" name="ADMUX" offset="0x10" size="1">
          <bitfield caption="Reference Selection Bit" mask="0x40" name="REFS" values="ANALOG_ADC_V_REF"/>
          <bitfield caption="Analog Channel and Gain Selection Bits" mask="0x0F" name="MUX" values="ADC_MUX"/>
        </register>
        <register caption="The ADC Control and Status register" name="ADCSRA" offset="0x12" size="1" ocd-rw="R">
          <bitfield caption="ADC Enable" mask="0x80" name="ADEN"/>
          <bitfield caption="ADC Start Conversion" mask="0x40" name="ADSC"/>
          <bitfield caption="ADC Auto Trigger Enable" mask="0x20" name="ADATE"/>
          <bitfield caption="ADC Interrupt Flag" mask="0x10" name="ADIF"/>
          <bitfield caption="ADC Interrupt Enable" mask="0x08" name="ADIE"/>
          <bitfield caption="ADC Prescaler Select Bits" mask="0x07" name="ADPS" values="ANALOG_ADC_PRESCALER"/>
        </register>
        <register caption="ADC Data Register  Bytes" name="ADC" offset="0x0E" size="2" mask="0xFFFF"/>
        <register caption="ADC Control and Status Register B" name="ADCSRB" offset="0x11" size="1">
          <bitfield caption="" mask="0x08" name="ADLAR"/>
          <bitfield caption="ADC Auto Trigger Sources" mask="0x07" name="ADTS" values="ANALOG_ADC_AUTO_TRIGGER3"/>
        </register>
        <register caption="Digital Input Disable Register 0" name="DIDR0" offset="0x0D" size="1">
          <bitfield caption="ADC6 Digital input Disable" mask="0x80" name="ADC7D"/>
          <bitfield caption="ADC5 Digital input Disable" mask="0x40" name="ADC6D"/>
          <bitfield caption="ADC4 Digital input Disable" mask="0x20" name="ADC5D"/>
          <bitfield caption="ADC3 Digital input Disable" mask="0x10" name="ADC4D"/>
          <bitfield caption="AREF Digital Input Disable" mask="0x08" name="ADC3D"/>
          <bitfield caption="ADC2 Digital input Disable" mask="0x04" name="ADC2D"/>
          <bitfield caption="ADC1 Digital input Disable" mask="0x02" name="ADC1D"/>
          <bitfield caption="ADC0 Digital input Disable" mask="0x01" name="ADC0D"/>
        </register>
      </register-group>
      <value-group caption="" name="ANALOG_ADC_V_REF">
        <value caption="Vcc used as internal reference" name="VAL_0x00" value="0x00"/>
        <value caption="Internal 1.1V Referemce" name="VAL_0x01" value="0x01"/>
      </value-group>
      <value-group caption="" name="ADC_MUX">
        <value caption="ADC0" name="ADC0" value="0x00"/>
        <value caption="ADC1" name="ADC1" value="0x01"/>
        <value caption="ADC2" name="ADC2" value="0x02"/>
        <value caption="ADC3" name="ADC3" value="0x03"/>
        <value caption="ADC4" name="ADC4" value="0x04"/>
        <value caption="ADC5" name="ADC5" value="0x05"/>
        <value caption="ADC6" name="ADC6" value="0x06"/>
        <value caption="ADC7" name="ADC7" value="0x07"/>
        <value caption="0V (AGND)" name="ADC_GND" value="0x08"/>
        <value caption="1.1V Internal Reference" name="ADC_VBG" value="0x09"/>
        <value caption="Temperature sensor" name="TEMPSENS" value="0x0A"/>
      </value-group>
