avr-rust/avrd/packs/tiny/ATtiny20.atdf
        <register caption="TWI Slave Control Register B" name="TWSCRB" offset="0x2C" size="1">
          <bitfield caption="TWI Acknowledge Action" mask="0x04" name="TWAA"/>
          <bitfield caption="" mask="0x03" name="TWCMD"/>
        </register>
        <register caption="TWI Slave Status Register A" name="TWSSRA" offset="0x2B" size="1" mask="0xFF"/>
        <register caption="TWI Slave Address Register" name="TWSA" offset="0x2A" size="1" ocd-rw="R">
          <bitfield caption="TWI slave address bit" mask="0xFF" name="TWSA"/>
        </register>
        <register caption="TWI Slave Data Register" name="TWSD" offset="0x28" size="1" ocd-rw="R">
          <bitfield caption="TWI slave data bit" mask="0xFF" name="TWSD"/>
        </register>
        <register caption="TWI Slave Address Mask Register" name="TWSAM" offset="0x29" size="1" mask="0xFF"/>
      </register-group>
    </module>
    <module caption="Timer/Counter, 16-bit" name="TC16">
      <register-group caption="Timer/Counter, 16-bit" name="TC1">
        <register caption="Timer/Counter1 Control Register A" name="TCCR1A" offset="0x24" size="1">
          <bitfield caption="Compare Output Mode 1A, bits" mask="0xC0" name="COM1A"/>
          <bitfield caption="Compare Output Mode 1B, bits" mask="0x30" name="COM1B"/>
          <bitfield caption="Waveform Generation Mode Bits" mask="0x03" name="WGM1"/>
        </register>
        <register caption="Timer/Counter1 Control Register B" name="TCCR1B" offset="0x23" size="1">
          <bitfield caption="Input Capture 1 Noise Canceler" mask="0x80" name="ICNC1"/>
          <bitfield caption="Input Capture 1 Edge Select" mask="0x40" name="ICES1"/>
          <bitfield caption="Waveform Generation Mode" mask="0x18" name="WGM1" lsb="2"/>
          <bitfield caption="Clock Select1 bits" mask="0x07" name="CS1" values="CLK_SEL_3BIT_EXT"/>
        </register>
        <register caption="Timer/Counter1 Control Register C" name="TCCR1C" offset="0x22" size="1">
          <bitfield caption="Force Output Compare for channel A" mask="0x80" name="FOC1A"/>
          <bitfield caption="Force Output Compare for channel B" mask="0x40" name="FOC1B"/>
        </register>
        <register caption="Timer/Counter1 " name="TCNT1" offset="0x20" size="2" mask="0xFFFF"/>
        <register caption="Timer/Counter 1 Output Compare Register A " name="OCR1A" offset="0x1E" size="2" mask="0xFFFF"/>
        <register caption="Timer/Counter1 Output Compare Register B " name="OCR1B" offset="0x1C" size="2" mask="0xFFFF"/>
        <register caption="Input Capture Register  Bytes" name="ICR1" offset="0x1A" size="2" mask="0xFFFF"/>
        <register caption="Timer Interrupt Mask Register" name="TIMSK" offset="0x26" size="1">
          <bitfield caption="Input Capture Interrupt Enable" mask="0x80" name="ICIE1"/>
          <bitfield caption="Output Compare B Match Interrupt Enable" mask="0x20" name="OCIE1B"/>
          <bitfield caption="Output Compare A Match Interrupt Enable" mask="0x10" name="OCIE1A"/>
          <bitfield caption="Overflow Interrupt Enable" mask="0x09" name="TOIE"/>
          <bitfield caption="Timer/Counter Output Compare Match B Interrupt Enable" mask="0x04" name="OCIE0B"/>
          <bitfield caption="Timer/Counter0 Output Compare Match A Interrupt Enable" mask="0x02" name="OCIE0A"/>
        </register>
        <register caption="Overflow Interrupt Enable" name="TIFR" offset="0x25" size="1">
          <bitfield caption="Input Capture Flag" mask="0x80" name="ICF1"/>
          <bitfield caption="Timer Output Compare Flag 1B" mask="0x20" name="OCF1B"/>
          <bitfield caption="Timer Output Compare Flag 1A" mask="0x10" name="OCF1A"/>
          <bitfield caption="Timer Overflow Flag" mask="0x09" name="TOV"/>
          <bitfield caption="Output Compare Flag 0 B" mask="0x04" name="OCF0B"/>
          <bitfield caption="Output Compare Flag 0 A" mask="0x02" name="OCF0A"/>
        </register>
        <register caption="General Timer/Counter Control Register" name="GTCCR" offset="0x27" size="1">
          <bitfield caption="Timer Synchronization Mode" mask="0x80" name="TSM"/>
          <bitfield caption="Prescaler Reset" mask="0x01" name="PSR"/>
        </register>
      </register-group>
      <value-group caption="" name="CLK_SEL_3BIT_EXT">
        <value caption="No Clock Source (Stopped)" name="VAL_0x00" value="0x00"/>
        <value caption="Running, No Prescaling" name="VAL_0x01" value="0x01"/>
        <value caption="Running, CLK/8" name="VAL_0x02" value="0x02"/>
        <value caption="Running, CLK/64" name="VAL_0x03" value="0x03"/>
        <value caption="Running, CLK/256" name="VAL_0x04" value="0x04"/>
        <value caption="Running, CLK/1024" name="VAL_0x05" value="0x05"/>
        <value caption="Running, ExtClk Tx Falling Edge" name="VAL_0x06" value="0x06"/>
        <value caption="Running, ExtClk Tx Rising Edge" name="VAL_0x07" value="0x07"/>
      </value-group>
    </module>
    <module caption="Serial Peripheral Interface" name="SPI">
      <register-group caption="Serial Peripheral Interface" name="SPI">
        <register caption="SPI Control Register" name="SPCR" offset="0x30" size="1">
          <bitfield caption="SPI Interrupt Enable" mask="0x80" name="SPIE"/>
          <bitfield caption="SPI Enable" mask="0x40" name="SPE"/>
          <bitfield caption="Data Order" mask="0x20" name="DORD"/>
          <bitfield caption="Master/Slave Select" mask="0x10" name="MSTR"/>
          <bitfield caption="Clock polarity" mask="0x08" name="CPOL"/>
          <bitfield caption="Clock Phase" mask="0x04" name="CPHA"/>
          <bitfield caption="SPI Clock Rate Selects" mask="0x03" name="SPR" values="COMM_SCK_RATE"/>
        </register>
        <register caption="SPI Status Register" name="SPSR" offset="0x2F" size="1">
          <bitfield caption="SPI Interrupt Flag" mask="0x80" name="SPIF"/>
          <bitfield caption="Write Collision Flag" mask="0x40" name="WCOL"/>
          <bitfield caption="Double SPI Speed Bit" mask="0x01" name="SPI2X"/>
        </register>
        <register caption="SPI Data Register" name="SPDR" offset="0x2E" size="1" mask="0xFF"/>
      </register-group>
      <value-group caption="" name="COMM_SCK_RATE">
        <value caption="fcl/4" name="VAL_0x00" value="0x00"/>
        <value caption="fcl/16" name="VAL_0x01" value="0x01"/>
        <value caption="fcl/64" name="VAL_0x02" value="0x02"/>
        <value caption="fcl/128" name="VAL_0x03" value="0x03"/>
      </value-group>
    </module>
  </modules>
  <pinouts>
    <pinout name="DIP">
      <pin pad="VCC" position="1"/>
      <pin pad="PB0" position="2"/>
      <pin pad="PB1" position="3"/>
      <pin pad="PB3" position="4"/>
      <pin pad="PB2" position="5"/>
      <pin pad="PA7" position="6"/>
      <pin pad="PA6" position="7"/>
      <pin pad="PA5" position="8"/>
      <pin pad="PA4" position="9"/>
      <pin pad="PA3" position="10"/>
      <pin pad="PA2" position="11"/>
      <pin pad="PA1" position="12"/>
      <pin pad="PA0" position="13"/>
      <pin pad="GND" position="14"/>
    </pinout>
    <pinout name="VQFN">
      <pin pad="PA4" position="1"/>
      <pin pad="PA3" position="2"/>
      <pin pad="PA2" position="3"/>
      <pin pad="PA1" position="4"/>
      <pin pad="PA0" position="5"/>
      <pin pad="GND" position="8"/>
      <pin pad="VCC" position="9"/>
      <pin pad="PB0" position="11"/>
      <pin pad="PB1" position="12"/>
      <pin pad="PB3" position="13"/>
      <pin pad="PB2" position="14"/>
      <pin pad="PA7" position="15"/>
      <pin pad="PA6" position="16"/>
      <pin pad="PA5" position="17"/>
    </pinout>
    <pinout name="UFBGA">
      <pin pad="PA4" position="B1"/>
      <pin pad="PA3" position="C1"/>
      <pin pad="PA0" position="D1"/>
      <pin pad="PA5" position="A2"/>
      <pin pad="PA7" position="B2"/>
      <pin pad="PA2" position="C2"/>
      <pin pad="GND" position="D2"/>
      <pin pad="PA6" position="A3"/>
      <pin pad="PB1" position="B3"/>
      <pin pad="PA1" position="C3"/>
      <pin pad="GND" position="D3"/>
      <pin pad="PB2" position="A4"/>
      <pin pad="PB3" position="B4"/>
      <pin pad="PB0" position="C4"/>
      <pin pad="VCC" position="D4"/>
    </pinout>
    <pinout name="WLCSP">
      <pin pad="PA4" position="A1"/>
      <pin pad="PA1" position="A3"/>
      <pin pad="PA2" position="A5"/>
      <pin pad="PA6" position="B2"/>
      <pin pad="GND" position="B4"/>
      <pin pad="VDD" position="B6"/>
      <pin pad="PA5" position="C1"/>
      <pin pad="PA7" position="C3"/>
      <pin pad="PB1" position="C5"/>
      <pin pad="PB2" position="D2"/>
      <pin pad="PB3" position="D4"/>
      <pin pad="PB0" position="D6"/>
    </pinout>
  </pinouts>
</avr-tools-device-file>
